# 任务1：数值类型与算术运算符
# 1.1 整数运算（支持大整数）
a = 100
b = 23
print("整数运算：")
print(f"{a} + {b} = {a + b}") # 加法
print(f"{a} - {b} = {a - b}") # 减法
print(f"{a} * {b} = {a * b}") # 乘法
print(f"{a} / {b} = {a / b}")   # 除法（浮点数）
print(f"{a} // {b} = {a // b}") # 整除
print(f"{a} % {b} = {a % b}")   # 取余
print(f"{a} ** {b} = {a ** b}") # 幂运算（100^23）

# 1.2 实数运算（注意浮点数精度问题）
c = 0.1
d = 0.2
print("\n实数运算")
print(f"{ c } + { d } = {c + d}")
print(f"修正精度: { round(c + d, 1)}") # 用round()函数保留1位小数

# 1.3 复数运算
e = 3 + 4j      # 复数（实部3，虚部4）
f = 1 - 2j
print("\n复数运算：")
print(f"{e} + {f} = {e + f}") # 复数加法（实部加实部，虚部加虚部）
print(f"{e}的模: { abs(e) }")  # 复数的模（sqrt(3²+4²)=5)





